"use strict";
class Course {
    constructor(department, classification, detailedClassification, number, code, name, credit, substitutes) {
        this.department = department;
        this.classification = classification;
        this.detailedClassification = detailedClassification;
        this.number = number;
        this.code = code;
        this.name = name;
        this.credit = credit;
        this.substitutes = substitutes;
    }
}
const COURSE_LIST_CSV = `
학과,과목구분,세부 과목구분,과목번호,전산코드,교과목명,강:실:학(숙제),이수요건 대체과목,개설학기,비고
인문사회과학부,교양필수,논술,HSS001,10.103,논리적 글쓰기,3:0:3(6),,"봄,가을",
인문사회과학부,교양필수,논술,HSS002,10.274,비평적 글쓰기,3:0:3(6),,"봄,가을",
인문사회과학부,교양필수,논술,HSS003,10.275,실용적 글쓰기,3:0:3(6),,"봄,가을",
인문사회과학부,교양필수,논술,HSS004,10.276,창의적 글쓰기,3:0:3(6),,"봄,가을",
인문사회과학부,교양필수,논술,HSS006,10.108,한국어1(학부),3:0:3(6),,"봄,가을",
인문사회과학부,교양필수,영어,HSS022,10.022,English Presentation & Discussion,2:0:1(4),,"봄,가을",
인문사회과학부,교양필수,영어,HSS023,10.023,Advanced English Listening,2:0:1(4),,"봄,가을",
인문사회과학부,교양필수,영어,HSS024,10.024,Advanced English Writing,2:0:1(4),,"봄,가을",
인문사회과학부,교양필수,영어,HSS025,10.025,Advanced English Reading,2:0:1(4),,"봄,가을",
인문사회과학부,교양필수,체육,HSS040,10.180,배드민턴,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS041,10.181,수영,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS042,10.182,테니스,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS043,10.183,농구,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS045,10.195,야구,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS046,10.186,골프,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS047,10.187,축구와 풋살,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS048,10.189,체육동아리,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS050,10.050,댄스스포츠,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS051,10.051,체력육성,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS052,10.052,코어운동,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS053,13.053,발레핏,2AU,,"봄,가을",
인문사회과학부,교양필수,체육,HSS054,13.054,고급수영,2AU,,"봄,가을",
인문사회과학부,교양필수,인성 리더십,HSS060,10.172,인성/리더십I,1AU,,"봄,가을",
인문사회과학부,교양필수,인성 리더십,HSS061,10.173,인성/리더십II,1AU,,"봄,가을",
인문사회과학부,교양필수,인성 리더십,HSS062,10.174,인성/리더십III,1AU,,"봄,가을",
인문사회과학부,교양필수,윤리 및 안전,HSS070,10.179,윤리및안전II,1AU,,"봄,가을",
인문사회과학부,교양필수,봉사활동,HSS080,10.200,봉사활동,2AU,,"봄,가을",
인문사회과학부,교양필수,즐거운 대학생활,HSS090,10.090,즐거운 대학생활,1AU,,"봄,가을",
인문사회과학부,교양필수,신나는 대학생활,HSS091,10.091,신나는 대학생활,1AU,,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS100,10.111,과학사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS101,10.112,과학기술과 철학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS102,10.212,한국과학기술사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS105,10.135,논리학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS106,10.255,언어의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS107,10.134,철학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS109,10.109,행복론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS110,10.297,한국문화사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS111,10.298,한국근현대사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS112,10.231,한국사상사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS113,10.136,한국사 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS114,10.114,"한글, 문자, 문명",3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS115,10.115,한국 근대의 재발견,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS116,10.367,영어와 미국문화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS119,13.101,독일어권 문화 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS124,10.233,동양문화사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS127,10.235,윤리학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS128,10.236,동양철학입문,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS137,10.137,The Geography of Korea for International Students,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS138,10.138,외국인을 위한 한국역사와 문화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS139,10.139,종교학의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS144,13.144,서양문명의 기원,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS145,13.145,중세이후의 서양문명,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS147,13.147,사회언어학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS201,13.103,과학기술 혁명,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS202,10.217,동아시아의 과학기술사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS203,10.218,환경주의:역사학적 개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS204,10.204,동서양 과학문명의 탄생과 전개,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS206,10.234,분석철학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS208,10.232,한국사회경제사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS209,13.105,한국문자와 표기의 역사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS211,10.256,영어의 구조와 문법,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS214,13.106,Europe and the World Science 1492,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS215,13.107,근현대 미국사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS216,10.279,현대세계의 형성,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS220,10.238,영화사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS221,13.108,Self and Identity in Modern Thought,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS226,13.226,고전라틴어,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS227,13.227,고전문학과 철학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS237,13.237,생명윤리학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS301,10.332,철학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS302,10.351,언어학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS303,10.331,한국사특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS304,10.333,역사학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS305,13.109,세계문화특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS306,13.110,Seminar in Humanities,1:0:1,,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS307,10.307,한국현대정치사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS308,10.308,환경윤리학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS309,10.309,근현대 서양 지성사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS328,13.328,수학철학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS404,13.139,"Human, Computer, Language",3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS405,13.140,논리학과 인공지능,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS409,13.141,근대인물 오디세이,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS412,13.142,English and Society,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,인문계열,HSS423,10.423,표상과 재현,3:0:3(6),,"봄,가을",◎
인문사회과학부,인문사회선택,인문계열,HSS436,10.436,심리철학,3:0:3(6),,"봄,가을",◎
인문사회과학부,인문사회선택,사회계열,HSS130,10.113,과학기술과 사회,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS133,10.145,심리학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS134,10.239,인지과학입문,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS142,13.138,문명과 사상,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS143,13.143,현대 중국의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS146,13.146,인간관계와 커뮤니케이션,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS148,10.143,사회학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS150,10.150,정치학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS154,13.154,영화속의 법,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS155,13.115,매스 커뮤니케이션의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS156,10.146,법학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS157,10.149,문화인류학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS159,10.144,경제학개론,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS160,13.116,Introduction to Pedagogy,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS163,10.163,법과 사회생활,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS169,10.169,경제와 법,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS231,10.211,과학기술과 윤리,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS232,10.214,과학기술사회학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS233,10.216,과학기술관련법,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS235,13.117,Thinking and Deciding,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS236,13.118,Applied Cognitive Science,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS240,10.247,Analysis of and Prospects for Korean Society,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS241,13.241,정치와 정부재정,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS242,13.242,중국의 정치경제,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS244,10.140,세계화의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS245,10.241,현대정치사상,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS246,13.120,Democracy&Economic Growth,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS247,13.121,International Law & International Organization,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS248,13.122,민족과 문화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS249,13.249,음식인류학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS250,13.250,동아시아 지정학의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS252,13.252,도시・지역 개발의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS253,13.123,회사법,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS255,10.245,젠더와 사회,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS256,13.256,중국의 사회와 문화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS257,10.257,바이오테크법제와 이슈,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS258,13.258,국제개발의 지리,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS262,10.262,상표권 침해 실무,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS263,10.263,특허 침해 실무,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS286,10.286,환경법,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS295,13.295,현대사회이론,3:0:3(6),,"봄,여름,가을,겨울",
인문사회과학부,인문사회선택,사회계열,HSS310,13.310,경제학특강,3:0:3(6),,"봄,여름,가을,겨울",
인문사회과학부,인문사회선택,사회계열,HSS311,13.311,법학특강,3:0:3(6),,"봄,여름,가을,겨울",
인문사회과학부,인문사회선택,사회계열,HSS312,13.312,사회학특강,3:0:3(6),,"봄,여름,가을,겨울",
인문사회과학부,인문사회선택,사회계열,HSS330,10.311,과학기술학 특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS331,13.125,Special Lecture in Cognitive Science,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS332,10.341,사회과학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS333,10.344,심리학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS334,13.126,Seminar in Cognitive Science,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS336,10.336,미국 민주주의의 전통,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS337,10.337,뉴미디어와 커뮤니케이션,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS338,10.338,"과학기술, 민주주의, 시장",3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS339,13.339,인터넷 커뮤니케이션,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS340,13.340,한국정치의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS345,10.345,복지국가와 사회보장,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS353,10.353,창조적 활동과 법,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS431,10.431,동아시아의 안보와 경제,3:0:3(6),,"봄,가을",◎
인문사회과학부,인문사회선택,사회계열,HSS433,13.127,Brain and Cognition,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS434,13.128,Computational Cognitive Processing,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS437,13.129,북한의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS447,13.130,Man and War,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS451,13.131,지속가능한 발전:아젠다와 지향,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS453,10.453,행동경제학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS454,10.454,Political Economy of Science & Technology,3:0:3(8),,"봄,가을",
인문사회과학부,인문사회선택,사회계열,HSS455,10.455,Philosophy of Science Policy,3:0:3(8),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS120,10.120,Understanding Korean Cinema,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS164,10.164,영화의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS166,10.129,한국문화이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS167,10.223,한국문학과 사회,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS171,10.122,영미문학의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS175,10.151,독일어 회화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS176,10.152,일본어 회화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS177,10.153,불어 회화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS178,10.154,중국어 회화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS179,10.156,스페인어 회화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS186,10.124,서양음악사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS187,10.125,미술사와 시각문화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS217,13.217,헐리우드와 중국의 판타지영화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS265,10.221,한국시 다시 읽기,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS266,10.222,한국소설 다시 읽기,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS267,10.177,한국음악문화이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS268,10.268,중국어회화 Ⅱ,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS269,10.269,Animation in East Asia,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS270,10.225,영미 시,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS271,10.224,영미 소설,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS272,10.229,영미 드라마와 영화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS273,10.369,영미 단편소설,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS274,13.132,영미 과학소설,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS275,13.275,아시아 미술의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS276,13.276,만화와 미국영화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS277,10.295,뮤지컬의 세계,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS278,10.294,근대 미술,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS279,13.133,1945년 이후 미술,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS280,10.126,세계음악의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS281,10.226,외국문화와 문학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS320,10.320,건축사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS321,13.321,한문으로 읽는 동양고전,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS322,13.322,음악과 뇌,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS324,10.324,영미 과학영화,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS325,10.325,르네상스와 바로크 미술,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS326,10.326,현대영문학,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS360,10.322,한국문학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS361,10.323,영문학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS362,10.321,예술학특강,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS370,10.370,"시각, 뇌, 예술",3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS371,13.371,20세기 아시아 건축,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS374,10.374,근대 건축사,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS375,10.375,20세기 동아시아 미술,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS376,10.376,음악현상의 이해,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS378,10.378,바이올린 제작과 실험,3:0:3(4),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS470,13.135,English Literature and History,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS471,13.136,Gender and Literature,3:0:3(6),,"봄,가을",
인문사회과학부,인문사회선택,문학예술계열,HSS472,13.137,예술과 철학,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS008,13.008,글쓰기의 기초,1:00:01,,"봄,가을",
인문사회과학부,자유선택,,HSS010,10.010,Intermediate English Speaking&Listening,3:0:2(6),,"봄,가을",
인문사회과학부,자유선택,,HSS011,10.009,Intermediate English Reading&Writing,3:0:2(6),,"봄,가을",
인문사회과학부,자유선택,,HSS170,10.170,지식융합,1:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS180,13.180,기초 한국어와 한국문화,2:0:2,,"봄,가을",
인문사회과학부,자유선택,,HSS189,10.110,새내기 세미나 2,1:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS190,10.100,새내기 세미나 1,1:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS191,10.104,Reading in English,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS192,10.166,사랑학,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS193,10.167,한국어2(학부),3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS194,10.171,리더십훈련,3:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS195,10.188,영어특강,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS197,10.191,인간운동과학 특강,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS198,10.192,커뮤니케이션 훈련,3:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS199,10.199,읽기와 토론 특강,2:0:1(3),,"봄,가을",
인문사회과학부,자유선택,,HSS200,13.200,ICL특강,2:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS212,10.368,영미산문,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS290,10.196,발표와 토론,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS291,10.291,체력평가 및 컨디셔닝,2:3:3,,"봄,가을",
인문사회과학부,자유선택,,HSS292,10.292,비즈니스 영어 프로젝트,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS293,10.293,Statistics in the Social Sciences,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS296,10.296,운동과 다이어트,2:3:3,,"봄,가을",
인문사회과학부,자유선택,,HSS390,10.360,Advanced English Conversation,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS392,10.362,English Science Writing,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS393,10.363,English Presentation,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS394,10.364,인터넷 영어,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS395,10.365,시사영어,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS396,10.366,과학영어강독,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS398,10.372,English Conversation,3:0:2(4),,"봄,가을",
인문사회과학부,자유선택,,HSS399,10.377,Creative English Writing,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS430,10.430,운동학의 이해,3:0:3(6),,"봄,가을",◎
인문사회과학부,자유선택,,HSS479,10.479,English Debate,3:0:3(6),,"봄,가을",
인문사회과학부,자유선택,,HSS483,10.483,과학기술정책 사례연구,3:0:3,,"봄,가을",◎
인문사회과학부,자유선택,,HSS484,10.484,정책특강,1:0:1,,"봄,가을",◎
인문사회과학부,자유선택,,HSS485,10.485,보고서 작성법,1:0:1,,"봄,가을",◎
인문사회과학부,자유선택,,HSS490,10.490,문화․예술과 이미지코드,3:0:3,,"봄,가을",◎
인문사회과학부,자유선택,,HSS491,10.401,한국어3,3:0:3(6),,"봄,가을",◎
인문사회과학부,자유선택,,HSS492,10.410,Special Topics in Humanities & Social Sciences,1:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS493,10.411,Special Topics in Art,1:0:1,,"봄,가을",
인문사회과학부,자유선택,,HSS494,10.494,한국어4,3:0:3(6),,"봄,가을",◎
인문사회과학부,연구,,HSS495,10.495,개별연구,0:6:1,,"봄,가을",
물리학과,기초필수,,PH121,20.121,기초물리학 I,3:1:3(6),,,
물리학과,기초필수,,PH141,20.141,일반물리학 I,3:1:3(6),"PH121,PH161",,
물리학과,기초필수,,PH161,20.161,고급물리학 I,3:1:3(6),,,
물리학과,기초필수,,PH122,20.122,기초물리학 II,3:1:3(6),,,
물리학과,기초필수,,PH142,20.142,일반물리학 II,3:1:3(6),"PH122,PH162",,
물리학과,기초필수,,PH162,20.162,고급물리학 II,3:1:3(6),,,
물리학과,기초필수,,PH151,20.151,일반물리학실험 I,0:3:1(3),,,
생명과학과,기초필수,,BS110,21.110,기초생물학,3:0:3(2),,,
생명과학과,기초필수,,BS120,21.120,일반생물학,3:0:3(2),BS110,,
수리과학과,기초필수,,MAS101,25.101,미적분학 I,3:1:3(6),MAS103,,
수리과학과,기초필수,,MAS103,25.103,고급미적분학 I,3:1:3(6),,,
수리과학과,기초필수,,MAS102,25.102,미적분학 II,3:1:3(6),MAS104,,
수리과학과,기초필수,,MAS104,25.104,고급미적분학 II,3:1:3(6),,,
화학과,기초필수,,CH100,23.100,기초화학,3:0:3(3),,,
화학과,기초필수,,CH101,23.101,일반화학 I,3:0:3(3),"CH100,CH105",,
화학과,기초필수,,CH105,23.105,고급화학,3:0:3(3),,,
화학과,기초필수,,CH102,23.102,일반화학 실험 I,0:3:1(1.5),CH106,,
화학과,기초필수,,CH106,23.106,고급화학실험,0:3:1(1.5),,,
전산학부,기초필수,,CS101,36.101,프로그래밍기초,2:3:3(5),CS102,,
전산학부,기초필수,,CS102,36.102,고급프로그래밍,2:3:3(5),,,
기타 (무학),기초선택,,AA100,12.100,현대과학기술 이해,3:0:1,,,
물리학과,기초선택,,PH152,20.152,일반물리학실험 II,0:3:1(3),,,
수리과학과,기초선택,,MAS109,25.109,선형대수학개론,3:1:3(6),,,
수리과학과,기초선택,,MAS201,22.201,응용미분방정식,3:1:3(6),,,
수리과학과,기초선택,,MAS202,22.202,응용해석학,3:1:3(6),,,
수리과학과,기초선택,,MAS250,22.250,확률 및 통계,3:1:3(6),,,
화학과,기초선택,,CH103,23.103,일반화학 II,3:0:3(3),,,
화학과,기초선택,,CH104,23.104,일반화학실험 II,0:3:1(1.5),,,
바이오및뇌공학과,기초선택,,BiS102,41.102,바이오공학의 이해,3:0:3(6),,,
건설및환경공학과,기초선택,,CE101,37.101,인류 문명과 건설,3:0:3(5),,,
기계공학과,기초선택,,MAE106,40.106,인간과 기계,3:0:3(3),,,
항공우주공학과,기초선택,,MAE107,40.107,창공과 우주,3:0:3,,,
기계공학과,기초선택,,MAE208,40.208,새로운 기계의 설계와 체험,2:3:3(3),,,
신소재공학과,기초선택,,MS211,34.211,신소재과학개론,3:0:3(3),,,
원자력및양자공학과,기초선택,,NQE101,33.101,원자력과 양자의 세계,3:0:3(3),,,
전기및전자공학부,기초선택,,EE105,35.105,전자공학개론,3:0:3(6),,,
전산학부,기초선택,,CS109,36.109,프로그래밍 실습,2:3:3,,,
산업및시스템공학과,기초선택,,IE200,31.200,OR개론,3:1:3(4),,,
산업및시스템공학과,기초선택,,IE201,31.201,산업공학응용 및 실습,2:3:3(4),,,
산업디자인학과,기초선택,,ID201,32.201,디자인과 생활,3:0:3(2),,,
산업디자인학과,기초선택,,ID202,32.202,발상과 표현,3:1:3(3),,,
기타 (테크노경영),기초선택,,MGT201,53.201,경영공학실습,2:3:3(4),,,
기타 (무학),기초선택,,ED100,14.100,설계와 커뮤니케이션,3:3:3,,,
기타 (융합교과),기초선택,,ED200,14.200,"빛, 생명, 그리고 색채",3:0:3,,,
기타 (공과대),기초선택,,ITC201,,IT융합 사용자 중심 서비스 디자인,2:3:3,,,
기타 (공과대),기초선택,,ITC202,,IT융합 시스템 디자인,2:3:3,,,
기타 (공과대),기초선택,,ITC203,,IT융합 디자인 프로젝트,1:6:3,,,
기타 (공과대),기초선택,,ITC204,,시스템 헬스케어,3:0:3,,,
기타 (공과대),기초선택,,ITC205,,전자자동차시스템개론,3:0:3,,,
기타 (공과대),기초선택,,ITC206,,문화콘텐츠ICT서비스 디자인:이론과 실제,3:0:3,,,
기타 (과학기술정책학 부전공),기초선택,,STP110,,엔지니어의 삶,3:0:3,,,
전산학부,기초필수,,CS101,36.101,프로그래밍 기초,2:3:3,,"봄, 가을",
전산학부,기초선택,,CS109,36.109,프로그래밍 실습,2:3:3,,봄 혹은 가을,
전산학부,전공필수,,CS204,36.204,이산구조,3:0:3(8),"MAS275,MA260","봄, 가을",
전산학부,전공필수,,CS206,36.206,데이타구조,3:0:3(6),,"봄, 가을",
전산학부,전공필수,,CS300,36.300,알고리즘 개론,3:0:3(8),,"봄, 가을",
전산학부,전공필수,,CS311,36.311,전산기 조직,3:0:3(3),EE312,"봄, 가을",
전산학부,전공필수,,CS320,36.320,프로그래밍 언어,3:0:3(3),,"봄, 가을",
전산학부,전공필수,,CS330,36.330,운영체제 및 실험,3:3:4(12),,"봄, 가을",
전산학부,전공필수,,CS408,36.408,전산학 프로젝트,1:6:3,,"봄, 가을",
전산학부,전공선택,,CS202,36.202,문제해결기법,2:3:3(15),,"봄, 가을",
전산학부,전공선택,,CS211,36.211,디지탈시스템 및 실험,3:3:4(10),,봄,
전산학부,전공선택,,CS220,36.220,프로그래밍의 이해,3:0:3(6),,봄 혹은 가을,
전산학부,전공선택,,CS230,36.230,시스템프로그래밍,3:0:3(4),,"봄, 가을",
전산학부,전공선택,,CS270,36.270,지능 로봇 설계 및 프로그래밍,2:3:3,,봄,
전산학부,전공선택,,CS310,36.310,내장형 컴퓨터 시스템,3:3:4(10),,가을,
전산학부,전공선택,,CS322,36.322,형식언어 및 오토마타,3:0:3(6),,가을,
전산학부,전공선택,,CS324,36.324,금융 공학 프로그래밍,3:0:3,,봄,
전산학부,전공선택,,CS340,36.340,네트워크 과학의 융합적 접근,3:0:3,,가을,
전산학부,전공선택,,CS341,36.341,전산망 개론,3:3:4,,가을,
전산학부,전공선택,,CS350,36.350,소프트웨어 공학 개론,3:0:3(2),,봄,
전산학부,전공선택,,CS360,36.360,데이타베이스 개론,3:0:3(8),,봄 혹은 가을,
전산학부,전공선택,,CS362,36.362,화일구조론,2:3:3(3),,가을,
전산학부,전공선택,,CS370,36.370,심볼릭 프로그래밍,2:3:3(6),,봄,
전산학부,전공선택,,CS372,36.372,파이썬을 통한 자연언어처리,3:0:3,,봄 혹은 가을,
전산학부,전공선택,,CS374,36.374,인간-컴퓨터 상호작용 개론,3:1:3,,봄,
전산학부,전공선택,,CS376,36.376,기계학습,3:0:3,,봄 혹은 가을,
전산학부,전공선택,,CS380,36.380,컴퓨터그래픽스개론,3:3:4(6),,봄,
전산학부,전공선택,,CS402,36.402,전산논리학 개론,3:0:3(6),,봄 혹은 가을,◎
전산학부,전공선택,,CS406,36.406,전산학을 위한 수학,3:0:3,,가을,◎
전산학부,전공선택,,CS409,36.409,산학협업 소프트웨어 프로젝트,1:6:3,,봄 혹은 가을,
전산학부,전공선택,,CS410,36.410,VLSI설계개론,3:0:3(4),,봄 혹은 가을,◎
전산학부,전공선택,,CS420,36.420,컴파일러 설계,3:0:3(6),,봄,◎
전산학부,전공선택,,CS422,36.422,계산이론,3:0:3(8),,봄 혹은 가을,◎
전산학부,전공선택,,CS440,36.440,데이타통신,3:0:3(6),,봄 혹은 가을,◎
전산학부,전공선택,,CS442,36.442,모바일 컴퓨팅과 응용,3:0:3,,봄,◎
전산학부,전공선택,,CS443,36.443,분산 알고리즘 및 시스템,3:0:3,,가을,◎
전산학부,전공선택,,CS448,36.448,정보보호개론,3:0:3(1),,봄,◎
전산학부,전공선택,,CS451,36.451,IT 서비스공학,3:1:3(6),,가을,◎
전산학부,전공선택,,CS452,36.452,비즈니스 프로세스 설계 및 관리,3:0:3,,가을,◎
전산학부,전공선택,,CS453,36.453,소프트웨어 테스팅 자동화 기법,3:0:3(6),,가을,◎
전산학부,전공선택,,CS454,36.454,인공 지능 기반 소프트웨어 공학,3:0:3,,가을,◎
전산학부,전공선택,,CS455,36.455,소프트웨어 프로젝트,2:3:3(4),,가을,◎
전산학부,전공선택,,CS457,36.457,스마트 환경을 위한 요구공학,3:0:3,,봄,◎
전산학부,전공선택,,CS459,36.459,서비스 컴퓨팅 개론,3:0:3(6),,가을,◎
전산학부,전공선택,,CS470,36.470,인공지능개론,3:0:3(8),,가을,◎
전산학부,전공선택,,CS473,36.473,소셜 컴퓨팅 개론,3:0:3,,가을,◎
전산학부,전공선택,,CS474,36.474,텍스트마이닝,3:0:3,,가을,◎
전산학부,전공선택,,CS476,36.476,바이오의료응용 집단지성,3:0:3(6),,가을,◎
전산학부,전공선택,,CS478,36.478,금융 데이터 분석 기법,3:0:3,,가을,◎
전산학부,전공선택,,CS482,36.482,대화형 컴퓨터그래픽스,3:2:3,,봄 혹은 가을,◎
전산학부,전공선택,,CS484,36.484,컴퓨터 비전 개론,3:0:3,,가을,◎
전산학부,전공선택,,CS489,36.489,컴퓨터 윤리와 사회문제,3:0:3(2),,가을,◎
전산학부,전공선택,,CS492,36.492,전산학특강,3:0:3(6),,봄 혹은 가을,◎
전산학부,전공선택,,CS493,36.493,전산학특강 Ⅰ,1:0:1,,봄 혹은 가을,
전산학부,전공선택,,CS494,36.494,전산학특강 Ⅱ,2:0:2,,봄 혹은 가을,
전산학부,연구,,CS490,36.490,졸업연구,0:6:3,,"봄, 가을",
전산학부,연구,,CS495,36.495,개별연구,0:6:1,,"봄, 가을",
전산학부,연구,,CS496,36.496,세미나,0:2:1,,"봄, 가을",
전기및전자공학부,기초선택,,EE105,35.105,세상을 바꾸는 전자공학,3:0:3,,가을,
전기및전자공학부,전공필수,,EE201,35.201,회로이론,3:1:3(6),,"봄, 가을",
전기및전자공학부,전공필수,,EE202,35.202,신호 및 시스템,3:1:3(6),,"봄, 가을",□MAS101
전기및전자공학부,전공필수,,EE204,35.204,전기자기학,3:0:3(6),,"봄, 가을",
전기및전자공학부,전공필수,,EE209,35.209,전자공학을 위한 프로그래밍 구조,3:0:3(6),,"봄, 가을",
전기및전자공학부,전공필수,,EE305,35.305,전자설계 및 실험,1:6:3(6),,"봄, 가을","□EE201,EE202,EE2 04,EE209"
전기및전자공학부,전공필수,,EE405,35.405,전자 디자인 랩,1:6:3(6),,"봄, 가을",□EE305
전기및전자공학부,전공선택,,EE205,35.205,전자공학을 위한 자료구조 및 알고리듬,3:0:3(6),,가을,
전기및전자공학부,전공선택,,EE210,35.210,확률과 기초 확률과정,3:0:3(6),,"봄, 가을",
전기및전자공학부,전공선택,,EE211,35.211,물리전자개론,3:0:3(6),,"봄, 가을",
전기및전자공학부,전공선택,,EE212,35.212,전자설계실습,1:6:3(6),,가을,
전기및전자공학부,전공선택,,EE213,35.213,전자공학을 위한 이산 방법론,3:0:3(6),,봄,
전기및전자공학부,전공선택,,EE303,35.303,디지털시스템,3:1:3(6),,"봄, 가을",
전기및전자공학부,전공선택,,EE304,35.304,전자회로,3:1:3(6),,"봄, 가을",□EE201
전기및전자공학부,전공선택,,EE312,35.312,컴퓨터구조개론,3:1:3(6),,가을,□EE303
전기및전자공학부,전공선택,,EE321,35.321,통신공학,3:0:3(6),,"봄, 가을",□EE202
전기및전자공학부,전공선택,,EE323,35.323,컴퓨터 네트워크,3:0:3(6),,봄,□EE209
전기및전자공학부,전공선택,,EE324,35.324,네트워크 프로그래밍,3:1:3(6),,가을,"□EE209,EE323"
전기및전자공학부,전공선택,,EE326,35.326,정보이론 및 부호화 개론,3:0:3(6),,가을,□EE210
전기및전자공학부,전공선택,,EE331,35.331,기계학습개론,3:0:3(6),,봄,
전기및전자공학부,전공선택,,EE341,35.341,전자파 및 안테나,3:0:3(6),,봄,□EE204
전기및전자공학부,전공선택,,EE342,35.342,무선공학,3:1:3(6),,가을,"□EE204,EE304"
전기및전자공학부,전공선택,,EE362,35.362,반도체소자,3:0:3(6),,"봄, 가을",
전기및전자공학부,전공선택,,EE372,35.372,디지털 전자회로,3:0:3(6),,가을,
전기및전자공학부,전공선택,,EE381,35.381,제어시스템공학,3:0:3(6),,봄,□EE202
전기및전자공학부,전공선택,,EE391,35.391,전력전자제어,3:0:3(6),,봄,□EE202
전기및전자공학부,전공선택,,EE402,35.402,미래사회와 전자공학,2:0:2(4),,가을,◎
전기및전자공학부,전공선택,,EE403,35.403,아날로그 전자회로,3:0:3(6),,"봄, 가을","◎ □EE201,EE304"
전기및전자공학부,전공선택,,EE411,35.411,스위칭 및 오토마타이론,3:0:3(6),,봄,◎ □EE303
전기및전자공학부,전공선택,,EE412,35.412,빅데이터 분석개론,3:0:3(6),,가을,"◎ □MAS212,EE209,EE210"
전기및전자공학부,전공선택,,EE414,35.414,임베디드 시스템,3:1:3(6),,가을,◎ □EE303
전기및전자공학부,전공선택,,EE415,35.415,전자공학을 위한 운영체제 및 시스템 프로그래밍,3:0:3(6),,봄,◎ □EE209
전기및전자공학부,전공선택,,EE421,35.421,통신시스템,3:0:3(6),,봄,□EE321
전기및전자공학부,전공선택,,EE424,35.424,최적화개론,3:0:3(6),,가을,◎□MAS212
전기및전자공학부,전공선택,,EE425,35.425,무선 통신망,3:0:3(6),,봄,◎
전기및전자공학부,전공선택,,EE432,35.432,디지털신호처리,3:0:3(6),,"봄,가을",◎ □EE202
전기및전자공학부,전공선택,,EE441,35.441,광통신개론,3:0:3(6),,봄,◎
전기및전자공학부,전공선택,,EE450,35.450,과학기술 기업가 정신,3:0:3,,가을,◎
전기및전자공학부,전공선택,,EE451,35.451,IT 벤처창업의 실제,3:0:3,,봄,◎
전기및전자공학부,전공선택,,EE452,35.452,광공학 개론,3:0:3(6),,가을,◎
전기및전자공학부,전공선택,,EE463,35.463,반도체 집적회로 기술,3:0:3(6),,봄,"◎ □EE211,EE362"
전기및전자공학부,전공선택,,EE464,35.464,그린에너지 전자공학,3:0:3(6),,가을,◎
전기및전자공학부,전공선택,,EE466,35.466,바이오 및 의용 전자공학 개론,3:0:3(6),,가을,◎
전기및전자공학부,전공선택,,EE474,35.474,멀티미디어개론,3:0:3(6),,봄,◎ □EE202
전기및전자공학부,전공선택,,EE476,35.476,시청각 인지 모델,3:0:3(6),,가을,◎ □EE202
전기및전자공학부,전공선택,,EE481,35.481,지능시스템,3:0:3(6),,봄,◎ □EE381
전기및전자공학부,전공선택,,EE485,35.485,전자공학특강Ⅰ,1:0:1,,"봄, 가을",
전기및전자공학부,전공선택,,EE486,35.486,전자공학특강Ⅱ,2:0:2,,"봄, 가을",
전기및전자공학부,전공선택,,EE488,35.488,전기 전자공학특강 ,3:0:3(6),,"봄, 가을",
전기및전자공학부,연구,,EE490,35.490,졸업연구,0:6:3,,"봄, 가을",
전기및전자공학부,연구,,EE495,35.495,개별연구,0:6:1,,,
전기및전자공학부,연구,,EE496,35.496,세미나,1:0:1,,봄,
`;
const COURSE_LIST = new Map();
let result = this.Papa.parse(COURSE_LIST_CSV, {
    header: true,
    skipEmptyLines: true,
});
for (let data of result.data) {
    let classification = "교양필수 (AU)"; // garbage value
    let credit = -1;
    let matched;
    if ((matched = /\d+:\d+:(\d+)(\(\d+\))?/.exec(data["강:실:학(숙제)"])) !== null) {
        if (data["과목구분"] === "교양필수") {
            classification = "교양필수 (학점)";
        }
        else {
            classification = data["과목구분"];
        }
        credit = parseInt(matched[1]);
    }
    else if ((matched = /(\d+)AU/.exec(data["강:실:학(숙제)"])) !== null) {
        classification = "교양필수 (AU)";
        credit = parseInt(matched[1]);
    }
    else {
        console.error('wrong format', data["강:실:학(숙제)"]);
    }
    let substitutes = [];
    if (data["이수요건 대체과목"] !== "") {
        substitutes = data["이수요건 대체과목"].split(",");
    }
    COURSE_LIST.set(data["과목번호"], new Course(data["학과"], classification, (data["세부 과목구분"] === "") ? null : data["세부 과목구분"], data["과목번호"], data["전산코드"], data["교과목명"], credit, substitutes));
}
